## Multi-level grouping and broadcasting grouped aggregations

### What you will learn in this session

- Calculating grouped summary statistics using more than one column to group
- Broadcasting grouped summary statistics to create new columns

### Examples from the intro

#### import pandas and dataset

In [1]:
import pandas as pd

vc_sales = pd.read_csv('console_sales.csv')

#### Multi-level grouping and aggregating

Calculating the mean of the sold_year column for each company per decade.

In [24]:
vc_sales.groupby(['company', 'decade'])['sold_year'].mean()

company    decade
Microsoft  2000      7.386598e+06
           2010      6.462089e+06
Nintendo   2000      1.624794e+07
           2010      7.101272e+06
Sony       2000      9.799716e+06
           2010      6.926928e+06
Name: sold_year, dtype: float64

#### Broadcasting/creating new column based on grouped aggregation

Using `.transform()` will reproduce each of the aggregated values for the number of rows per group.

In [2]:
vc_sales.groupby(['platform'])['sold_year'].transform('sum')

0     84892507
1     84892507
2     84892507
3     84892507
4     84892507
        ...
76    15939902
77    15939902
78    15939902
79    15939902
80    15939902
Name: sold_year, Length: 81, dtype: int64

Creating a new column for the total sales per platform.

In [25]:
vc_sales['total_platform_sales'] = vc_sales.groupby(['platform'])['sold_year'].transform('sum')

vc_sales.head()

,company,platform,year,sold_year,sold_total,sold_year_pct_change,decade,total_platform_sales
0,Microsoft,X360,2005,1178267,1178267,NaN,2000,84892507
1,Microsoft,X360,2006,6801532,7979799,577.248790,2000,84892507
2,Microsoft,X360,2007,7879552,15859351,98.743740,2000,84892507
3,Microsoft,X360,2008,10913123,26772474,68.811914,2000,84892507
4,Microsoft,X360,2009,10160518,36932992,37.951360,2000,84892507

### Task 1- Multi-level grouping

1. Run the code cell below to load the titanic dataset
2. Calculate the average survival rate for each level of sex and pclass combined.
3. Calcualte the mean, standard deviation, min and max of age for each level of pclass and sex.

In [11]:
import pandas as pd
import seaborn as sns
titanic = sns.utils.load_dataset('titanic')

In [1]:
# Calculate the average survival rate for each level of sex and pclass combined.

In [2]:
# Calcualte the mean, standard deviation, min and max of age for each level of pclass and sex.

### Task 2 - Calculating new columns based on a grouping

1. Calculate a new column called 'pclass_survival' for the mean survival rate for each level of pclass.
2. Calculate a new column called 'pclass_sex_survival' for the mean survival rate for each level of pclass and sex combined.

In [3]:
# calculate a new column called 'pclass_survival' for the mean survival rate for each level of pclass.

In [4]:
# calculate a new column called 'pclass_sex_survival' for the mean survival rate for each level of pclass and sex combined.